In [69]:
import pandas as pd
import numpy as np

In [70]:
employees = pd.read_csv("datasets/employees.csv")
employees.head

<bound method NDFrame.head of      eid          name location        department                  title  \
0  E0124      John Doe   Austin               ITS     Software Developer
1  E0125       Luna Lu  Houston  Student Services        Student Advisor
2  E1119    Bella Tran   Austin        Accounting             Accountant
3  E2048     Raj Kumar   Dallas           Finance        Finance Manager
4  E2218    Sally Sims   Austin  Student Services     Software Developer
5  E4321  Alonzo Smith   Austin               ITS  Systems Administrator

  campus mail code Business Card  ages
0            A4011         vCard    49
1            G9109         vCard    43
2            D6336         vCard    59
3            C4315         vCard    56
4            G9109         vCard    28
5            A4011         vCard    34  >

In [71]:
employees_bad = pd.read_csv("datasets/employees-bad.csv")
employees_bad

,eid,name,location,department,title,campus mail code,Business Card,ages
0,NaN,John Doe,Austin,ITS,Software Developer,A4011,vCard,43
1,E0125,Luna Lu,Houston,Student Services,Student Advisor,G9109,vCard,43
2,E1119,Bella Tran,Austin,Accounting,Accountant,D6336,vCard,59
3,E2048,Raj Kumar,Dallas,Finance,Finance Manager,C4315,vCard,56
4,E2218,Sally Sims,Austin,Student Services,Software Developer,G9109,vCard,28
5,E4321,Alonzo Smith,Austin,ITS,Systems Administrator,A4011,vCard,34

In [72]:
r1_nan = employees_bad.iloc[[0]].get("eid")
r1_nan

0    NaN
Name: eid, dtype: object

In [73]:
r1_nan == np.nan

0    False
Name: eid, dtype: bool

In [74]:
r1_nan is not np.nan

True

In [75]:
r1_nan[0] is np.nan #[0] accesses the zeroth element in the series

True

In [76]:
cars = pd.read_csv("datasets/used_cars_data.csv")
cars.head()

,id,brand,model,model_year,mileage,fuel_type,engine,transmission,ext_col,int_col,accident,clean_title,price
0,0,Ford,F-150 Lariat,2018,74349,Gasoline,375.0HP 3.5L V6 Cylinder Engine Gasoline Fuel,10-Speed A/T,Blue,Gray,None reported,Yes,11000
1,1,BMW,335 i,2007,80000,Gasoline,300.0HP 3.0L Straight 6 Cylinder Engine Gasoli...,6-Speed M/T,Black,Black,None reported,Yes,8250
2,2,Jaguar,XF Luxury,2009,91491,Gasoline,300.0HP 4.2L 8 Cylinder Engine Gasoline Fuel,6-Speed A/T,Purple,Beige,None reported,Yes,15000
3,3,BMW,X7 xDrive40i,2022,2437,Hybrid,335.0HP 3.0L Straight 6 Cylinder Engine Gasoli...,Transmission w/Dual Shift Mode,Gray,Brown,None reported,Yes,63500
4,4,Pontiac,Firebird Base,2001,111000,Gasoline,200.0HP 3.8L V6 Cylinder Engine Gasoline Fuel,A/T,White,Black,None reported,Yes,7850

In [77]:
cars.shape

(101, 13)

In [78]:
cars.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 101 entries, 0 to 100
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            101 non-null    int64
 1   brand         101 non-null    object
 2   model         101 non-null    object
 3   model_year    101 non-null    int64
 4   mileage       101 non-null    int64
 5   fuel_type     95 non-null     object
 6   engine        101 non-null    object
 7   transmission  101 non-null    object
 8   ext_col       101 non-null    object
 9   int_col       98 non-null     object
 10  accident      101 non-null    object
 11  clean_title   101 non-null    object
 12  price         101 non-null    int64
dtypes: int64(4), object(9)
memory usage: 10.4+ KB

In [79]:
cars['id']

0        0
1        1
2        2
3        3
4        4
      ...
96      96
97      97
98      98
99      99
100    100
Name: id, Length: 101, dtype: int64

In [80]:
len(cars['id'].unique())

101

In [81]:
n = np.arange(start=0, stop=101, step=1)
cars['id'].sum() == n.sum()

True

In [82]:
#axis 0 for rows, axis 1 for columns
#inplace = true so it changes the existing df instead of
# making a new one
print(cars.columns.tolist())

['id', 'brand', 'model', 'model_year', 'mileage', 'fuel_type', 'engine', 'transmission', 'ext_col', 'int_col', 'accident', 'clean_title', 'price']

In [83]:
cars = cars.drop(columns=['id'])

In [84]:
cars.shape

(101, 12)

In [85]:
cars['engine'] = cars['engine'].str.extract(r'(\d+(\.\d+)?)')[0].astype(float) #grabs the horsepower and throws away everything else

In [86]:
cars.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 101 entries, 0 to 100
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   brand         101 non-null    object
 1   model         101 non-null    object
 2   model_year    101 non-null    int64
 3   mileage       101 non-null    int64
 4   fuel_type     95 non-null     object
 5   engine        101 non-null    float64
 6   transmission  101 non-null    object
 7   ext_col       101 non-null    object
 8   int_col       98 non-null     object
 9   accident      101 non-null    object
 10  clean_title   101 non-null    object
 11  price         101 non-null    int64
dtypes: float64(1), int64(3), object(8)
memory usage: 9.6+ KB

In [87]:
cars['engine']

0      375.0
1      300.0
2      300.0
3      335.0
4      200.0
       ...
96     255.0
97     381.0
98     228.0
99     150.0
100    250.0
Name: engine, Length: 101, dtype: float64